{
    "Identify": {
        "overview": "The Identify function of the NIST Cybersecurity Framework is foundational for developing an organizational understanding to manage cybersecurity risk to systems, people, assets, data, and capabilities. The activities in the Identify function are critical for enabling the organization to focus and prioritize its efforts, consistent with its risk management strategy and business needs.",
        "qnum": "1",
        "title": "Identify",
        "1": "Asset Management (ID.AM)",
        "1-summary": "The data, personnel, devices, systems, and facilities that enable the organization to achieve business purposes are identified and managed consistent with their relative importance to organizational objectives and the organization’s risk strategy.",
        "1-tier": "Tier 1",
        "1-points": "1",
        "1-conversation": "1. How are you currently identifying and managing assets within your organization? Would implementing an automated asset management system improve your visibility and control over your assets?",
        "1-recommendation": "Establish a comprehensive asset management strategy, incorporating automated tools to maintain an up-to-date inventory of assets. Ensure that all assets are classified based on their criticality and sensitivity.",
        "2": "Business Environment (ID.BE)",
        "2-summary": "The organization’s mission, objectives, stakeholders, and activities are understood and prioritized; this information is used to inform cybersecurity roles, responsibilities, and risk management decisions.",
        "2-tier": "Tier 1",
        "2-points": "2",
        "2-conversation": "1. How well do you understand your organization's mission, objectives, and activities? Could enhancing this understanding improve your cybersecurity decision-making?",
        "2-recommendation": "Develop a clear understanding of your business environment by identifying key stakeholders, missions, and objectives. Use this information to inform cybersecurity roles and responsibilities.",
        "3": "Governance (ID.GV)",
        "3-summary": "The policies, procedures, and processes to manage and monitor the organization’s regulatory, legal, risk, environmental, and operational requirements are understood and inform the management of cybersecurity risk.",
        "3-tier": "Tier 2",
        "3-points": "3",
        "3-conversation": "1. What governance structures do you have in place for cybersecurity? Could formalizing your governance processes enhance your compliance and risk management efforts?",
        "3-recommendation": "Implement a robust governance framework that includes clear policies, procedures, and processes for managing cybersecurity risk and compliance requirements.",
        "4": "Risk Assessment (ID.RA)",
        "4-summary": "The organization understands the cybersecurity risk to organizational operations (including mission, functions, image, or reputation), organizational assets, and individuals.",
        "4-tier": "Tier 2",
        "4-points": "4",
        "4-conversation": "1. How do you currently assess cybersecurity risk in your organization? Are there improvements you can make to your risk assessment process?",
        "4-recommendation": "Conduct regular risk assessments to identify and evaluate potential cybersecurity risks. Utilize a risk management framework to guide your assessment and mitigation efforts.",
        "5": "Risk Management Strategy (ID.RM)",
        "5-summary": "The organization’s priorities, constraints, risk tolerances, and assumptions are established and used to support operational risk decisions.",
        "5-tier": "Tier 3",
        "5-points": "5",
        "5-conversation": "1. Do you have a clear risk management strategy in place? How could refining this strategy enhance your cybersecurity posture?",
        "5-recommendation": "Develop and document a comprehensive risk management strategy that aligns with your organization's priorities and risk tolerances. Regularly review and update this strategy to adapt to evolving threats.",
        "6": "Supply Chain Risk Management (ID.SC)",
        "6-summary": "The organization’s priorities, constraints, risk tolerances, and assumptions are established and used to support risk decisions associated with managing supply chain risk. The organization has established and implemented the processes to identify, assess and manage supply chain risks.",
        "6-tier": "Tier 3",
        "6-points": "6",
        "6-conversation": "1. How do you manage supply chain risks in your organization? Are there additional measures you can implement to secure your supply chain?",
        "6-recommendation": "Implement processes to identify, assess, and manage supply chain risks. Collaborate with suppliers to ensure they meet your cybersecurity requirements.",
        "7": "Tier Definitions",
        "7-summary": "Tier 1: Partial - Informal, ad-hoc processes\nTier 2: Risk Informed - Risk management practices are approved and expressed\nTier 3: Repeatable - Risk management practices are formally approved and implemented\nTier 4: Adaptive - The organization adapts its cybersecurity practices based on lessons learned and predictive indicators",
        "7-tier": "Informational",
        "7-points": "0"
    },
    "Protect": {
        "overview": "The Protect function of the NIST Cybersecurity Framework outlines safeguards to ensure the delivery of critical infrastructure services. The Protect function supports the ability to limit or contain the impact of a potential cybersecurity event.",
        "qnum": "2",
        "title": "Protect",
        "1": "Identity Management and Access Control (PR.AC)",
        "1-summary": "Access to physical and logical assets and associated facilities is limited to authorized users, processes, and devices, and is managed consistent with the assessed risk of unauthorized access.",
        "1-tier": "Tier 1",
        "1-points": "1",
        "1-conversation": "1. How do you manage access to your physical and digital assets? Could enhancing your access control measures improve your security posture?",
        "1-recommendation": "Implement strong identity and access management practices, ensuring that only authorized users have access to critical assets. Regularly review and update access controls to reflect changing risks.",
        "2": "Awareness and Training (PR.AT)",
        "2-summary": "The organization’s personnel and partners are provided cybersecurity awareness education and are adequately trained to perform their information security-related duties and responsibilities consistent with related policies, procedures, and agreements.",
        "2-tier": "Tier 1",
        "2-points": "2",
        "2-conversation": "1. What cybersecurity training programs do you have in place? How can you improve your training initiatives to ensure all personnel are aware of their cybersecurity responsibilities?",
        "2-recommendation": "Develop and implement comprehensive cybersecurity training programs to educate personnel and partners about their roles and responsibilities. Regularly update training materials to address emerging threats and best practices.",
        "3": "Data Security (PR.DS)",
        "3-summary": "Information and records (data) are managed consistent with the organization’s risk strategy to protect the confidentiality, integrity, and availability of information.",
        "3-tier": "Tier 2",
        "3-points": "3",
        "3-conversation": "1. How do you currently protect your organization's data? Are there additional data security measures you can implement to enhance protection?",
        "3-recommendation": "Implement robust data security measures, including encryption, access controls, and regular audits. Ensure that data management practices align with your risk strategy and compliance requirements.",
        "4": "Information Protection Processes and Procedures (PR.IP)",
        "4-summary": "Security policies (that address purpose, scope, roles, responsibilities, management commitment, and coordination among organizational entities), processes, and procedures are maintained and used to manage protection of information systems and assets.",
        "4-tier": "Tier 2",
        "4-points": "4",
        "4-conversation": "1. Do you have formalized security policies and procedures in place? How can you enhance these policies to better protect your information systems?",
        "4-recommendation": "Establish and maintain comprehensive security policies and procedures. Ensure that all policies are well-documented, regularly reviewed, and updated to address evolving threats and organizational changes.",
        "5": "Maintenance (PR.MA)",
        "5-summary": "Maintenance and repairs of industrial control and information system components are performed consistent with policies and procedures.",
        "5-tier": "Tier 3",
        "5-points": "5",
        "5-conversation": "1. How do you ensure the maintenance and repair of your information systems are conducted securely? Are there improvements you can make to your maintenance practices?",
        "5-recommendation": "Develop and implement secure maintenance procedures, ensuring that all repairs and maintenance activities are performed in accordance with security policies. Regularly review and update maintenance practices to address emerging threats.",
        "6": "Protective Technology (PR.PT)",
        "6-summary": "Technical security solutions are managed to ensure the security and resilience of systems and assets, consistent with related policies, procedures, and agreements.",
        "6-tier": "Tier 3",
        "6-points": "6",
        "6-conversation": "1. What protective technologies do you use to secure your information systems? How can you enhance these technologies to improve your security posture?",
        "6-recommendation": "Implement and manage advanced protective technologies to secure your systems and assets. Regularly evaluate and update these technologies to ensure they align with your security policies and address emerging threats."
    },
    "Detect": {
        "overview": "The Detect function of the NIST Cybersecurity Framework defines the appropriate activities to identify the occurrence of a cybersecurity event. The Detect function enables timely discovery of cybersecurity events.",
        "qnum": "3",
        "title": "Detect",
        "1": "Anomalies and Events (DE.AE)",
        "1-summary": "Anomalous activity is detected in a timely manner and the potential impact of events is understood.",
        "1-tier": "Tier 1",
        "1-points": "1",
        "1-conversation": "1. How do you currently detect anomalous activity within your information systems? Are there additional measures you can implement to enhance your anomaly detection capabilities?",
        "1-recommendation": "Implement robust anomaly detection systems to identify and respond to unusual activities. Regularly review and update detection mechanisms to address evolving threats and improve detection accuracy.",
        "2": "Security Continuous Monitoring (DE.CM)",
        "2-summary": "The information system and assets are monitored at discrete intervals to identify cybersecurity events and verify the effectiveness of protective measures.",
        "2-tier": "Tier 1",
        "2-points": "2",
        "2-conversation": "1. What continuous monitoring practices do you have in place? How can you enhance these practices to ensure timely detection of cybersecurity events?",
        "2-recommendation": "Develop and implement continuous monitoring processes to ensure the ongoing security of your information systems. Utilize automated tools to enhance monitoring capabilities and detect cybersecurity events promptly.",
        "3": "Detection Processes (DE.DP)",
        "3-summary": "Detection processes and procedures are maintained and tested to ensure timely and adequate awareness of anomalous events.",
        "3-tier": "Tier 2",
        "3-points": "3",
        "3-conversation": "1. Do you have formalized detection processes and procedures? How can you improve these processes to ensure timely detection of cybersecurity events?",
        "3-recommendation": "Establish and maintain comprehensive detection processes and procedures. Regularly test and update these processes to ensure they effectively identify and respond to cybersecurity events.",
        "4": "Analyzing & Monitoring",
        "4-summary": "System logs and other event data are collected, reviewed, and analyzed to detect anomalies and identify potential incidents.",
        "4-tier": "Tier 2",
        "4-points": "4",
        "4-conversation": "1. How do you currently analyze and monitor system logs for anomalies? Are there improvements you can make to your log analysis practices?",
        "4-recommendation": "Implement centralized logging and monitoring solutions to collect and analyze system logs for anomalies. Regularly review and update log analysis practices to improve detection accuracy and efficiency.",
        "5": "Security Testing",
        "5-summary": "Testing and evaluation of security controls are conducted to ensure their effectiveness in protecting against potential threats and vulnerabilities.",
        "5-tier": "Tier 3",
        "5-points": "5",
        "5-conversation": "1. What security testing practices do you have in place? How can you enhance these practices to ensure the effectiveness of your security controls?",
        "5-recommendation": "Conduct regular security testing and evaluations to verify the effectiveness of your security controls. Utilize a combination of automated tools and manual assessments to identify and address potential vulnerabilities.",
        "6": "Incident Response",
        "6-summary": "Processes and procedures for responding to cybersecurity incidents are established and maintained to ensure timely and effective response and recovery.",
        "6-tier": "Tier 3",
        "6-points": "6",
        "6-conversation": "1. Do you have formalized incident response processes and procedures? How can you improve these processes to ensure timely and effective response to cybersecurity incidents?",
        "6-recommendation": "Develop and implement comprehensive incident response processes and procedures. Regularly review and update these processes to ensure they effectively address potential incidents and minimize impact."
    }
}
